In [1]:
import pandas as pd
import numpy as np

* from_dict()   creating DataFrame by a passing a dict
* describe()  returns multiple arithmetic results of a dataframe content, 

#### Dataframe creation:
* from dict of series
* from other column of DataFrame
* from numpy array


#### Accesssing values in DataFrame

* indexs -> df[1:2] 
* columns -> def[[1,2]]   /pass numpy array inside 

* loc() / returns o/p based on location passed 
* iloc  //returns o/p based on default index (0,1,2)
* iloc[1:2]
* iloc[1:3, 2:3]  --> rows,cols

In [2]:
#Regular dictionary within dictionary
SpotCrudePrices_2013_Data={
    'U.K. Brent' : {'2013-Q1':112.9, '2013-Q2':103.0, '2013-Q3':110.1, '2013-Q4':109.4},
    'Dubai':{'2013-Q1':108.1, '2013-Q2':100.8, '2013-Q3':106.1,'2013-Q4':106.7},
    'West Texas Intermediate':{'2013-Q1':94.4, '2013-Q2':94.2, '2013-Q3':105.8,'2013-Q4':97.4}}

In [3]:
#Create dataframe from dict of dict
dubaiPrices = pd.DataFrame.from_dict(SpotCrudePrices_2013_Data)

In [4]:
pd.DataFrame(SpotCrudePrices_2013_Data)
#u can use this approach also

         Dubai  U.K. Brent  West Texas Intermediate
2013-Q1  108.1       112.9                     94.4
2013-Q2  100.8       103.0                     94.2
2013-Q3  106.1       110.1                    105.8
2013-Q4  106.7       109.4                     97.4

In [5]:
dubaiPrices

         Dubai  U.K. Brent  West Texas Intermediate
2013-Q1  108.1       112.9                     94.4
2013-Q2  100.8       103.0                     94.2
2013-Q3  106.1       110.1                    105.8
2013-Q4  106.7       109.4                     97.4

In [6]:
dubaiPrices['Dubai']

2013-Q1    108.1
2013-Q2    100.8
2013-Q3    106.1
2013-Q4    106.7
Name: Dubai, dtype: float64

In [7]:
dubaiPrices.Dubai

2013-Q1    108.1
2013-Q2    100.8
2013-Q3    106.1
2013-Q4    106.7
Name: Dubai, dtype: float64

In [8]:
dubaiPrices.columns

Index(['Dubai', 'U.K. Brent', 'West Texas Intermediate'], dtype='object')

In [9]:
dubaiPrices.index

Index(['2013-Q1', '2013-Q2', '2013-Q3', '2013-Q4'], dtype='object')

In [10]:
dubaiPrices.describe()

            Dubai  U.K. Brent  West Texas Intermediate
count    4.000000    4.000000                 4.000000
mean   105.425000  108.850000                97.950000
std      3.195179    4.182902                 5.434151
min    100.800000  103.000000                94.200000
25%    104.775000  107.800000                94.350000
50%    106.400000  109.750000                95.900000
75%    107.050000  110.800000                99.500000
max    108.100000  112.900000               105.800000

In [11]:
#Changing/renaming col names
dubaiPrices.columns = ['Dubai','Brent','Texas']

In [12]:
dubaiPrices

         Dubai  Brent  Texas
2013-Q1  108.1  112.9   94.4
2013-Q2  100.8  103.0   94.2
2013-Q3  106.1  110.1  105.8
2013-Q4  106.7  109.4   97.4

In [13]:
#Get data by column index
dubaiPrices.Dubai[[1]]

2013-Q2    100.8
Name: Dubai, dtype: float64

In [14]:
#Get data by column index
# dubaiPrices[[1]]
#not works for python3 i doubt it

In [15]:

#Get data by column index
# dubaiPrices[[1,2]]
columns = dubaiPrices.columns
dubaiPrices = dubaiPrices.reindex(columns=columns)
dubaiPrices

         Dubai  Brent  Texas
2013-Q1  108.1  112.9   94.4
2013-Q2  100.8  103.0   94.2
2013-Q3  106.1  110.1  105.8
2013-Q4  106.7  109.4   97.4

In [16]:
dubaiPrices.Dubai[1:4]

2013-Q2    100.8
2013-Q3    106.1
2013-Q4    106.7
Name: Dubai, dtype: float64

In [17]:
dubaiPrices[1:2]

         Dubai  Brent  Texas
2013-Q2  100.8  103.0   94.2

In [18]:
dubaiPrices[:3]

         Dubai  Brent  Texas
2013-Q1  108.1  112.9   94.4
2013-Q2  100.8  103.0   94.2
2013-Q3  106.1  110.1  105.8

In [19]:
# import numpy as np
#Use arange to access elements
# dubaiPrices[np.arange(1,3)]

In [20]:
dubaiPrices[::-1]

         Dubai  Brent  Texas
2013-Q4  106.7  109.4   97.4
2013-Q3  106.1  110.1  105.8
2013-Q2  100.8  103.0   94.2
2013-Q1  108.1  112.9   94.4

In [21]:
dubaiPrices.columns

Index(['Dubai', 'Brent', 'Texas'], dtype='object')

In [22]:
# dubaiPrices[np.arange(2,3)]

In [23]:
NYC_SnowAvgsData={'Months' :
['January','February','March', 
'April', 'November', 'December'],
'Avg SnowDays' : [4.0,2.7,1.7,0.2,0.2,2.3],
'Avg Precip. (cm)' : [17.8,22.4,9.1,1.5,0.8,12.2],
'Avg Low Temp. (F)' : [27,29,35,45,42,32] }

In [24]:
NYC_SnowAvgs_index=pd.DataFrame(NYC_SnowAvgsData,  
                          index= NYC_SnowAvgsData['Months'], 
        columns = ['Avg SnowDays','Avg Precip. (cm)','Avg Low Temp. (F)'])

In [25]:
NYC_SnowAvgs_index

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January            4.0              17.8                 27
February           2.7              22.4                 29
March              1.7               9.1                 35
April              0.2               1.5                 45
November           0.2               0.8                 42
December           2.3              12.2                 32

In [26]:
#without mentioning months as index, but in column

NYC_SnowAvgs = pd.DataFrame(NYC_SnowAvgsData,  
#                           index= NYC_SnowAvgsData['Months'], 
        columns = ['Months','Avg SnowDays','Avg Precip. (cm)','Avg Low Temp. (F)'])

In [27]:
NYC_SnowAvgs

     Months  Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
0   January           4.0              17.8                 27
1  February           2.7              22.4                 29
2     March           1.7               9.1                 35
3     April           0.2               1.5                 45
4  November           0.2               0.8                 42
5  December           2.3              12.2                 32

In [28]:
NYC_SnowAvgs_index.loc['March']

Avg SnowDays          1.7
Avg Precip. (cm)      9.1
Avg Low Temp. (F)    35.0
Name: March, dtype: float64

In [29]:
NYC_SnowAvgs_index.loc[['March','April']]

       Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
March           1.7               9.1                 35
April           0.2               1.5                 45

In [30]:
NYC_SnowAvgs_index.loc[:'April']

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January            4.0              17.8                 27
February           2.7              22.4                 29
March              1.7               9.1                 35
April              0.2               1.5                 45

In [31]:
NYC_SnowAvgs_index.iloc[1:4]

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
February           2.7              22.4                 29
March              1.7               9.1                 35
April              0.2               1.5                 45

In [32]:
#First element is row, next one is column
NYC_SnowAvgs_index.iloc[1:,:2]

          Avg SnowDays  Avg Precip. (cm)
February           2.7              22.4
March              1.7               9.1
April              0.2               1.5
November           0.2               0.8
December           2.3              12.2

In [33]:
#what if duplicate index's , twice april
#Same index name being used

SnowAvgsData={'Months' :
['January','February','April', 
'April', 'November', 'December'],
'Avg SnowDays' : [4.0,2.7,1.7,0.2,0.2,2.3],
'Avg Precip. (cm)' : [17.8,22.4,9.1,1.5,0.8,12.2],
'Avg Low Temp. (F)' : [27,29,35,45,42,32] }

In [34]:
SnowAvgs_index=pd.DataFrame(SnowAvgsData,  
                          index= SnowAvgsData['Months'], 
        columns = ['Avg SnowDays','Avg Precip. (cm)','Avg Low Temp. (F)'])

In [35]:
SnowAvgs_index

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January            4.0              17.8                 27
February           2.7              22.4                 29
April              1.7               9.1                 35
April              0.2               1.5                 45
November           0.2               0.8                 42
December           2.3              12.2                 32

In [36]:
SnowAvgs_index.loc['April']

       Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
April           1.7               9.1                 35
April           0.2               1.5                 45

In [37]:
SnowAvgs_index.iloc[0:2 , 0:2]

          Avg SnowDays  Avg Precip. (cm)
January            4.0              17.8
February           2.7              22.4

In [39]:
SnowAvgs_index

          Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
January            4.0              17.8                 27
February           2.7              22.4                 29
April              1.7               9.1                 35
April              0.2               1.5                 45
November           0.2               0.8                 42
December           2.3              12.2                 32

In [41]:
SnowAvgs_index.loc['April']

       Avg SnowDays  Avg Precip. (cm)  Avg Low Temp. (F)
April           1.7               9.1                 35
April           0.2               1.5                 45

In [45]:
SnowAvgs_index.iloc[0]

Avg SnowDays          4.0
Avg Precip. (cm)     17.8
Avg Low Temp. (F)    27.0
Name: January, dtype: float64

In [47]:
SnowAvgs_index.iloc[1,2]

29.0

## Integer Oriented Indexing
* convert the column into index and then manipulate , this will make life easier

In [50]:
dubaiPrices.iloc[1:,2:]

         Texas
2013-Q2   94.2
2013-Q3  105.8
2013-Q4   97.4

In [52]:
dubaiPrices

         Dubai  Brent  Texas
2013-Q1  108.1  112.9   94.4
2013-Q2  100.8  103.0   94.2
2013-Q3  106.1  110.1  105.8
2013-Q4  106.7  109.4   97.4

In [57]:
dubaiPrices.at['2013-Q4','Dubai']

106.7

In [59]:
dubaiPrices.iat[3,0]

106.7

In [78]:
stockDF = pd.read_csv('Stock.csv')

In [79]:
stockDF

  TradingDate   Nasdaq  S&P 500  Russell 2000
0  2014/01/30  4123.13  1794.19       1139.36
1  2014/01/31  4103.88  1782.59       1130.88
2  2014/02/03  3996.96  1741.89       1094.58
3  2014/02/04  4031.52  1755.20       1102.84
4  2014/02/05  4011.55  1751.64       1093.59
5  2014/02/06  4057.12  1773.43       1103.93

In [80]:

stockIndexDF = stockDF.set_index('TradingDate')

In [82]:
stockIndexDF.ix['2014/02/03']

Nasdaq          3996.96
S&P 500         1741.89
Russell 2000    1094.58
Name: 2014/02/03, dtype: float64

In [84]:
stockIndexDF.loc['2014/02/03']

Nasdaq          3996.96
S&P 500         1741.89
Russell 2000    1094.58
Name: 2014/02/03, dtype: float64

In [86]:
stockIndexDF.ix[1]

Nasdaq          4103.88
S&P 500         1782.59
Russell 2000    1130.88
Name: 2014/01/31, dtype: float64

In [88]:
stockDF.ix[1]

TradingDate     2014/01/31
Nasdaq             4103.88
S&P 500            1782.59
Russell 2000       1130.88
Name: 1, dtype: object

## Multiindexing

In [90]:
stock_data = pd.read_csv('MoreStock.csv')

In [92]:
stock_data

   TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
0   2014/02/21      open  4282.17  1841.07       1166.25
1   2014/02/21     close  4263.41  1836.25       1164.63
2   2014/02/21      high  4284.85  1846.13       1168.43
3   2014/02/24      open  4273.32  1836.78       1166.74
4   2014/02/24     close  4292.97  1847.61       1174.55
5   2014/02/24      high  4311.13  1858.71       1180.29
6   2014/02/25      open  4298.48  1847.66       1176.00
7   2014/02/25     close  4287.59  1845.12       1173.95
8   2014/02/25      high  4307.51  1852.91       1179.43
9   2014/02/26      open  4300.45  1845.79       1176.11
10  2014/02/26     close  4292.06  1845.16       1181.72
11  2014/02/26      high  4316.82  1852.65       1188.06
12  2014/02/27      open  4291.47  1844.90       1179.28
13  2014/02/27     close  4318.93  1854.29       1187.94
14  2014/02/27      high  4322.46  1854.53       1187.94
15  2014/02/28      open  4323.52  1855.12       1189.19
16  2014/02/28     close  4308.12  1859.45       1183.03
17  2014/02/28      high  4342.59  1867.92       1193.50

In [94]:
stock_data.set_index('TradingDate')

            PriceType   Nasdaq  S&P 500  Russell 2000
TradingDate
2014/02/21       open  4282.17  1841.07       1166.25
2014/02/21      close  4263.41  1836.25       1164.63
2014/02/21       high  4284.85  1846.13       1168.43
2014/02/24       open  4273.32  1836.78       1166.74
2014/02/24      close  4292.97  1847.61       1174.55
2014/02/24       high  4311.13  1858.71       1180.29
2014/02/25       open  4298.48  1847.66       1176.00
2014/02/25      close  4287.59  1845.12       1173.95
2014/02/25       high  4307.51  1852.91       1179.43
2014/02/26       open  4300.45  1845.79       1176.11
2014/02/26      close  4292.06  1845.16       1181.72
2014/02/26       high  4316.82  1852.65       1188.06
2014/02/27       open  4291.47  1844.90       1179.28
2014/02/27      close  4318.93  1854.29       1187.94
2014/02/27       high  4322.46  1854.53       1187.94
2014/02/28       open  4323.52  1855.12       1189.19
2014/02/28      close  4308.12  1859.45       1183.03
2014/02/28       high  4342.59  1867.92       1193.50

In [99]:
stock_Index_data = stock_data.set_index(['TradingDate','PriceType'])

In [101]:
stock_Index_data.head()

                        Nasdaq  S&P 500  Russell 2000
TradingDate PriceType
2014/02/21  open       4282.17  1841.07       1166.25
            close      4263.41  1836.25       1164.63
            high       4284.85  1846.13       1168.43
2014/02/24  open       4273.32  1836.78       1166.74
            close      4292.97  1847.61       1174.55

In [103]:
stock_Index_data.index
 
#0->close
#1->high
#2->open

MultiIndex(levels=[['2014/02/21', '2014/02/24', '2014/02/25', '2014/02/26', '2014/02/27', '2014/02/28'], ['close', 'high', 'open']],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 2, 3, 3, 3, 4, 4, 4, 5, 5, 5], [2, 0, 1, 2, 0, 1, 2, 0, 1, 2, 0, 1, 2, 0, 1, 2, 0, 1]],
           names=['TradingDate', 'PriceType'])

In [106]:

stock_Index_data.ix['2014/02/21','open']

Nasdaq          4282.17
S&P 500         1841.07
Russell 2000    1166.25
Name: (2014/02/21, open), dtype: float64

In [107]:
stock_Index_data.ix['2014/02/21':'2014/02/25']

                        Nasdaq  S&P 500  Russell 2000
TradingDate PriceType
2014/02/21  open       4282.17  1841.07       1166.25
            close      4263.41  1836.25       1164.63
            high       4284.85  1846.13       1168.43
2014/02/24  open       4273.32  1836.78       1166.74
            close      4292.97  1847.61       1174.55
            high       4311.13  1858.71       1180.29
2014/02/25  open       4298.48  1847.66       1176.00
            close      4287.59  1845.12       1173.95
            high       4307.51  1852.91       1179.43